[Killed] BlockStatement
src/gilded_rose.mjs:2:38
 export class Item {
-  constructor(name, sellIn, quality) {
-    this.name = name;
-    this.sellIn = sellIn;
-    this.quality = quality;
-  }
+  constructor(name, sellIn, quality) {}
 
   createNormalItems() {
killedBy: Item name has Backstage passes When sell in date is greater than 10, quality increments by one
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] BlockStatement
src/gilded_rose.mjs:8:23
     this.quality = quality;
   }
 
-  createNormalItems() {
-    if (this.sellIn > 0) {
-      return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 1, 0));
-    } else {
-      return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 2, 0));
-    }
-  }
+  createNormalItems() {}
 
   createAgedBrie() {
killedBy: Gilded Rose normal items When sell in date is greater than zero, quality decrements by one
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] EqualityOperator
src/gilded_rose.mjs:9:9
   }
 
   createNormalItems() {
-    if (this.sellIn > 0) {
+    if (this.sellIn >= 0) {
       return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 1, 0));
     } else {
killedBy: Gilded Rose normal items When sell in date is less than or equal zero, quality decrements by two
statusReason: expected 2 to equal 1

[Killed] ConditionalExpression
src/gilded_rose.mjs:9:9
   }
 
   createNormalItems() {
-    if (this.sellIn > 0) {
+    if (false) {
       return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 1, 0));
     } else {
killedBy: Gilded Rose normal items When sell in date is greater than zero, quality decrements by one
statusReason: expected 1 to equal 2

[Killed] ArithmeticOperator
src/gilded_rose.mjs:10:34
 
   createNormalItems() {
     if (this.sellIn > 0) {
-      return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 1, 0));
+      return new Item(this.name, this.sellIn + 1, Math.max(this.quality - 1, 0));
     } else {
       return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 2, 0));
killedBy: Gilded Rose normal items When sell in date is greater than zero, quality decrements by one
statusReason: expected 2 to equal +0

[Killed] MethodExpression
src/gilded_rose.mjs:10:51
 
   createNormalItems() {
     if (this.sellIn > 0) {
-      return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 1, 0));
+      return new Item(this.name, this.sellIn - 1, Math.min(this.quality - 1, 0));
     } else {
       return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 2, 0));
killedBy: Gilded Rose normal items When sell in date is greater than zero, quality decrements by one
statusReason: expected +0 to equal 2

[Killed] BlockStatement
src/gilded_rose.mjs:11:12
   createNormalItems() {
     if (this.sellIn > 0) {
       return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 1, 0));
-    } else {
-      return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 2, 0));
-    }
+    } else {}
   }
 
killedBy: Gilded Rose normal items When sell in date is less than or equal zero, quality decrements by two
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] ArithmeticOperator
src/gilded_rose.mjs:12:34
     if (this.sellIn > 0) {
       return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 1, 0));
     } else {
-      return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 2, 0));
+      return new Item(this.name, this.sellIn + 1, Math.max(this.quality - 2, 0));
     }
   }
killedBy: Gilded Rose normal items When sell in date is less than or equal zero, quality decrements by two
statusReason: expected 1 to equal -1

[Killed] MethodExpression
src/gilded_rose.mjs:12:51
     if (this.sellIn > 0) {
       return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 1, 0));
     } else {
-      return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 2, 0));
+      return new Item(this.name, this.sellIn - 1, Math.min(this.quality - 2, 0));
     }
   }
killedBy: Gilded Rose normal items When sell in date is less than or equal zero, quality decrements by two
statusReason: expected +0 to equal 1

[Killed] BlockStatement
src/gilded_rose.mjs:16:20
     }
   }
 
-  createAgedBrie() {
-    if (this.sellIn > 0) {
-      return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 1, 50));
-    } else {
-      return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 2, 50));
-    }
-  }
+  createAgedBrie() {}
 
   createBackstagePasses() {
killedBy: Item name is Aged Brie When sell in date is greater than one, quality increments by one
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] EqualityOperator
src/gilded_rose.mjs:17:9
   }
 
   createAgedBrie() {
-    if (this.sellIn > 0) {
+    if (this.sellIn <= 0) {
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 1, 50));
     } else {
killedBy: Item name is Aged Brie When sell in date is greater than one, quality increments by one
statusReason: expected 5 to equal 4

[Killed] ConditionalExpression
src/gilded_rose.mjs:17:9
   }
 
   createAgedBrie() {
-    if (this.sellIn > 0) {
+    if (true) {
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 1, 50));
     } else {
killedBy: Item name is Aged Brie When sell in date is zero, quality increments by two
statusReason: expected 4 to equal 5

[Killed] ArithmeticOperator
src/gilded_rose.mjs:18:60
 
   createAgedBrie() {
     if (this.sellIn > 0) {
-      return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 1, 50));
+      return new Item(this.name, this.sellIn - 1, Math.min(this.quality - 1, 50));
     } else {
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 2, 50));
killedBy: Item name is Aged Brie When sell in date is greater than one, quality increments by one
statusReason: expected 2 to equal 4

[Killed] ArithmeticOperator
src/gilded_rose.mjs:18:34
 
   createAgedBrie() {
     if (this.sellIn > 0) {
-      return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 1, 50));
+      return new Item(this.name, this.sellIn + 1, Math.min(this.quality + 1, 50));
     } else {
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 2, 50));
killedBy: Item name is Aged Brie When sell in date is greater than one, quality increments by one
statusReason: expected 2 to equal +0

[Killed] BlockStatement
src/gilded_rose.mjs:19:12
   createAgedBrie() {
     if (this.sellIn > 0) {
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 1, 50));
-    } else {
-      return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 2, 50));
-    }
+    } else {}
   }
 
killedBy: Item name is Aged Brie When sell in date is zero, quality increments by two
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] ArithmeticOperator
src/gilded_rose.mjs:20:34
     if (this.sellIn > 0) {
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 1, 50));
     } else {
-      return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 2, 50));
+      return new Item(this.name, this.sellIn + 1, Math.min(this.quality + 2, 50));
     }
   }
killedBy: Item name is Aged Brie When sell in date is zero, quality increments by two
statusReason: expected 1 to equal -1

[Killed] ArithmeticOperator
src/gilded_rose.mjs:20:60
     if (this.sellIn > 0) {
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 1, 50));
     } else {
-      return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 2, 50));
+      return new Item(this.name, this.sellIn - 1, Math.min(this.quality - 2, 50));
     }
   }
killedBy: Item name is Aged Brie When sell in date is zero, quality increments by two
statusReason: expected 1 to equal 5

[Killed] BlockStatement
src/gilded_rose.mjs:24:27
     }
   }
 
-  createBackstagePasses() {
-    if (this.sellIn <= 0) {
-      return new Item(this.name, this.sellIn - 1, 0);
-    } else if (this.sellIn <= 5) {
-      return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 3, 50));
-    } else if (this.sellIn <= 10) {
-      return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 2, 50));
-    } else {
-      return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 1, 50));
-    }
-  }
+  createBackstagePasses() {}
 
   createSulfuras() {
killedBy: Item name has Backstage passes When sell in date is greater than 10, quality increments by one
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
src/gilded_rose.mjs:25:27
   }
 
   createBackstagePasses() {
-    if (this.sellIn <= 0) {
-      return new Item(this.name, this.sellIn - 1, 0);
-    } else if (this.sellIn <= 5) {
+    if (this.sellIn <= 0) {} else if (this.sellIn <= 5) {
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 3, 50));
     } else if (this.sellIn <= 10) {
killedBy: Item name has Backstage passes When sell in date is zero, quality drops to zero
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] ConditionalExpression
src/gilded_rose.mjs:25:9
   }
 
   createBackstagePasses() {
-    if (this.sellIn <= 0) {
+    if (false) {
       return new Item(this.name, this.sellIn - 1, 0);
     } else if (this.sellIn <= 5) {
killedBy: Item name has Backstage passes When sell in date is zero, quality drops to zero
statusReason: expected 23 to equal +0

[Killed] ArithmeticOperator
src/gilded_rose.mjs:26:34
 
   createBackstagePasses() {
     if (this.sellIn <= 0) {
-      return new Item(this.name, this.sellIn - 1, 0);
+      return new Item(this.name, this.sellIn + 1, 0);
     } else if (this.sellIn <= 5) {
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 3, 50));
killedBy: Item name has Backstage passes When sell in date is zero, quality drops to zero
statusReason: expected 1 to equal -1

[Killed] ConditionalExpression
src/gilded_rose.mjs:27:16
   createBackstagePasses() {
     if (this.sellIn <= 0) {
       return new Item(this.name, this.sellIn - 1, 0);
-    } else if (this.sellIn <= 5) {
+    } else if (false) {
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 3, 50));
     } else if (this.sellIn <= 10) {
killedBy: Item name has Backstage passes When sell in date is less than or equal 5, quality increments by three
statusReason: expected 5 to equal 6

[Killed] EqualityOperator
src/gilded_rose.mjs:27:16
   createBackstagePasses() {
     if (this.sellIn <= 0) {
       return new Item(this.name, this.sellIn - 1, 0);
-    } else if (this.sellIn <= 5) {
+    } else if (this.sellIn > 5) {
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 3, 50));
     } else if (this.sellIn <= 10) {
killedBy: Item name has Backstage passes When sell in date is greater than 10, quality increments by one
statusReason: expected 6 to equal 4

[Killed] ArithmeticOperator
src/gilded_rose.mjs:28:60
     if (this.sellIn <= 0) {
       return new Item(this.name, this.sellIn - 1, 0);
     } else if (this.sellIn <= 5) {
-      return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 3, 50));
+      return new Item(this.name, this.sellIn - 1, Math.min(this.quality - 3, 50));
     } else if (this.sellIn <= 10) {
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 2, 50));
killedBy: Item name has Backstage passes When sell in date is less than or equal 5, quality increments by three
statusReason: expected +0 to equal 6

[Killed] MethodExpression
src/gilded_rose.mjs:28:51
     if (this.sellIn <= 0) {
       return new Item(this.name, this.sellIn - 1, 0);
     } else if (this.sellIn <= 5) {
-      return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 3, 50));
+      return new Item(this.name, this.sellIn - 1, Math.max(this.quality + 3, 50));
     } else if (this.sellIn <= 10) {
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 2, 50));
killedBy: Item name has Backstage passes When sell in date is less than or equal 5, quality increments by three
statusReason: expected 50 to equal 6

[Killed] BlockStatement
src/gilded_rose.mjs:29:35
       return new Item(this.name, this.sellIn - 1, 0);
     } else if (this.sellIn <= 5) {
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 3, 50));
-    } else if (this.sellIn <= 10) {
-      return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 2, 50));
-    } else {
+    } else if (this.sellIn <= 10) {} else {
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 1, 50));
     }
killedBy: Item name has Backstage passes When sell in date is less than or equal 10, quality increments by two
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] ConditionalExpression
src/gilded_rose.mjs:29:16
       return new Item(this.name, this.sellIn - 1, 0);
     } else if (this.sellIn <= 5) {
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 3, 50));
-    } else if (this.sellIn <= 10) {
+    } else if (true) {
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 2, 50));
     } else {
killedBy: Item name has Backstage passes When sell in date is greater than 10, quality increments by one
statusReason: expected 5 to equal 4

[Killed] MethodExpression
src/gilded_rose.mjs:30:51
     } else if (this.sellIn <= 5) {
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 3, 50));
     } else if (this.sellIn <= 10) {
-      return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 2, 50));
+      return new Item(this.name, this.sellIn - 1, Math.max(this.quality + 2, 50));
     } else {
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 1, 50));
killedBy: Item name has Backstage passes When sell in date is less than or equal 10, quality increments by two
statusReason: expected 50 to equal 5

[Killed] ArithmeticOperator
src/gilded_rose.mjs:30:34
     } else if (this.sellIn <= 5) {
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 3, 50));
     } else if (this.sellIn <= 10) {
-      return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 2, 50));
+      return new Item(this.name, this.sellIn + 1, Math.min(this.quality + 2, 50));
     } else {
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 1, 50));
killedBy: Item name has Backstage passes When sell in date is less than or equal 10, quality increments by two
statusReason: expected 11 to equal 9

[Killed] BlockStatement
src/gilded_rose.mjs:31:12
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 3, 50));
     } else if (this.sellIn <= 10) {
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 2, 50));
-    } else {
-      return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 1, 50));
-    }
+    } else {}
   }
 
killedBy: Item name has Backstage passes When sell in date is greater than 10, quality increments by one
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] ArithmeticOperator
src/gilded_rose.mjs:32:60
     } else if (this.sellIn <= 10) {
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 2, 50));
     } else {
-      return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 1, 50));
+      return new Item(this.name, this.sellIn - 1, Math.min(this.quality - 1, 50));
     }
   }
killedBy: Item name has Backstage passes When sell in date is greater than 10, quality increments by one
statusReason: expected 2 to equal 4

[Killed] ArithmeticOperator
src/gilded_rose.mjs:32:34
     } else if (this.sellIn <= 10) {
       return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 2, 50));
     } else {
-      return new Item(this.name, this.sellIn - 1, Math.min(this.quality + 1, 50));
+      return new Item(this.name, this.sellIn + 1, Math.min(this.quality + 1, 50));
     }
   }
killedBy: Item name has Backstage passes When sell in date is greater than 10, quality increments by one
statusReason: expected 12 to equal 10

[Killed] BlockStatement
src/gilded_rose.mjs:36:20
     }
   }
 
-  createSulfuras() {
-    return new Item(this.name, this.sellIn, 80);
-  }
+  createSulfuras() {}
 
   createConjured() {
killedBy: Item name is Sulfuras It never has to be sold and it never loses it's quality
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
src/gilded_rose.mjs:40:20
     return new Item(this.name, this.sellIn, 80);
   }
 
-  createConjured() {
-    if (this.sellIn > 0) {
-      return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 2, 0));
-    } else {
-      return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 4, 0));
-    }
-  }
+  createConjured() {}
 
   update() {
killedBy: Gilded Rose conjured Items degrades twice as fast as normal items When sell in date is greater than zero, quality decrements by two
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] EqualityOperator
src/gilded_rose.mjs:41:9
   }
 
   createConjured() {
-    if (this.sellIn > 0) {
+    if (this.sellIn >= 0) {
       return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 2, 0));
     } else {
killedBy: Gilded Rose conjured Items degrades twice as fast as normal items When sell in date is less than or equal zero, quality decrements by four
statusReason: expected 3 to equal 1

[Killed] EqualityOperator
src/gilded_rose.mjs:41:9
   }
 
   createConjured() {
-    if (this.sellIn > 0) {
+    if (this.sellIn <= 0) {
       return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 2, 0));
     } else {
killedBy: Gilded Rose conjured Items degrades twice as fast as normal items When sell in date is greater than zero, quality decrements by two
statusReason: expected 1 to equal 3

[Killed] ArithmeticOperator
src/gilded_rose.mjs:42:60
 
   createConjured() {
     if (this.sellIn > 0) {
-      return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 2, 0));
+      return new Item(this.name, this.sellIn - 1, Math.max(this.quality + 2, 0));
     } else {
       return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 4, 0));
killedBy: Gilded Rose conjured Items degrades twice as fast as normal items When sell in date is greater than zero, quality decrements by two
statusReason: expected 7 to equal 3

[Killed] MethodExpression
src/gilded_rose.mjs:42:51
 
   createConjured() {
     if (this.sellIn > 0) {
-      return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 2, 0));
+      return new Item(this.name, this.sellIn - 1, Math.min(this.quality - 2, 0));
     } else {
       return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 4, 0));
killedBy: Gilded Rose conjured Items degrades twice as fast as normal items When sell in date is greater than zero, quality decrements by two
statusReason: expected +0 to equal 3

[Killed] BlockStatement
src/gilded_rose.mjs:43:12
   createConjured() {
     if (this.sellIn > 0) {
       return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 2, 0));
-    } else {
-      return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 4, 0));
-    }
+    } else {}
   }
 
killedBy: Gilded Rose conjured Items degrades twice as fast as normal items When sell in date is less than or equal zero, quality decrements by four
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] ArithmeticOperator
src/gilded_rose.mjs:44:60
     if (this.sellIn > 0) {
       return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 2, 0));
     } else {
-      return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 4, 0));
+      return new Item(this.name, this.sellIn - 1, Math.max(this.quality + 4, 0));
     }
   }
killedBy: Gilded Rose conjured Items degrades twice as fast as normal items When sell in date is less than or equal zero, quality decrements by four
statusReason: expected 9 to equal 1

[Killed] ArithmeticOperator
src/gilded_rose.mjs:44:34
     if (this.sellIn > 0) {
       return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 2, 0));
     } else {
-      return new Item(this.name, this.sellIn - 1, Math.max(this.quality - 4, 0));
+      return new Item(this.name, this.sellIn + 1, Math.max(this.quality - 4, 0));
     }
   }
killedBy: Gilded Rose conjured Items degrades twice as fast as normal items When sell in date is less than or equal zero, quality decrements by four
statusReason: expected 1 to equal -1

[Killed] BlockStatement
src/gilded_rose.mjs:48:12
     }
   }
 
-  update() {
-    const itemName = this.name.toLowerCase().trim();
-    if (itemName.includes("aged brie")) {
-      return this.createAgedBrie();
-    } else if (itemName.includes("backstage passes")) {
-      return this.createBackstagePasses();
-    } else if (itemName.includes("sulfuras")) {
-      return this.createSulfuras();
-    } else if (itemName.includes("conjured")) {
-      return this.createConjured();
-    } else {
-      return this.createNormalItems();
-    }
-  }
+  update() {}
 }
 
killedBy: Item name has Backstage passes When sell in date is greater than 10, quality increments by one
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] MethodExpression
src/gilded_rose.mjs:49:22
   }
 
   update() {
-    const itemName = this.name.toLowerCase().trim();
+    const itemName = this.name.toUpperCase().trim();
     if (itemName.includes("aged brie")) {
       return this.createAgedBrie();
killedBy: Item name has Backstage passes When sell in date is greater than 10, quality increments by one
statusReason: expected 2 to equal 4

[Survived] MethodExpression
src/gilded_rose.mjs:49:22
   }
 
   update() {
-    const itemName = this.name.toLowerCase().trim();
+    const itemName = this.name.toLowerCase();
     if (itemName.includes("aged brie")) {
       return this.createAgedBrie();

[Killed] ConditionalExpression
src/gilded_rose.mjs:50:9
 
   update() {
     const itemName = this.name.toLowerCase().trim();
-    if (itemName.includes("aged brie")) {
+    if (false) {
       return this.createAgedBrie();
     } else if (itemName.includes("backstage passes")) {
killedBy: Item name is Aged Brie When sell in date is greater than one, quality increments by one
statusReason: expected 2 to equal 4

[Killed] BlockStatement
src/gilded_rose.mjs:50:41
 
   update() {
     const itemName = this.name.toLowerCase().trim();
-    if (itemName.includes("aged brie")) {
-      return this.createAgedBrie();
-    } else if (itemName.includes("backstage passes")) {
+    if (itemName.includes("aged brie")) {} else if (itemName.includes("backstage passes")) {
       return this.createBackstagePasses();
     } else if (itemName.includes("sulfuras")) {
killedBy: Item name is Aged Brie When sell in date is greater than one, quality increments by one
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] ConditionalExpression
src/gilded_rose.mjs:52:16
     const itemName = this.name.toLowerCase().trim();
     if (itemName.includes("aged brie")) {
       return this.createAgedBrie();
-    } else if (itemName.includes("backstage passes")) {
+    } else if (true) {
       return this.createBackstagePasses();
     } else if (itemName.includes("sulfuras")) {
killedBy: Gilded Rose conjured Items degrades twice as fast as normal items When sell in date is greater than zero, quality decrements by two
statusReason: expected 8 to equal 3

[Killed] BlockStatement
src/gilded_rose.mjs:52:55
     const itemName = this.name.toLowerCase().trim();
     if (itemName.includes("aged brie")) {
       return this.createAgedBrie();
-    } else if (itemName.includes("backstage passes")) {
-      return this.createBackstagePasses();
-    } else if (itemName.includes("sulfuras")) {
+    } else if (itemName.includes("backstage passes")) {} else if (itemName.includes("sulfuras")) {
       return this.createSulfuras();
     } else if (itemName.includes("conjured")) {
killedBy: Item name has Backstage passes When sell in date is greater than 10, quality increments by one
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] ConditionalExpression
src/gilded_rose.mjs:54:16
       return this.createAgedBrie();
     } else if (itemName.includes("backstage passes")) {
       return this.createBackstagePasses();
-    } else if (itemName.includes("sulfuras")) {
+    } else if (true) {
       return this.createSulfuras();
     } else if (itemName.includes("conjured")) {
killedBy: Gilded Rose conjured Items degrades twice as fast as normal items When sell in date is greater than zero, quality decrements by two
statusReason: expected 1 to equal +0

[Killed] ConditionalExpression
src/gilded_rose.mjs:54:16
       return this.createAgedBrie();
     } else if (itemName.includes("backstage passes")) {
       return this.createBackstagePasses();
-    } else if (itemName.includes("sulfuras")) {
+    } else if (false) {
       return this.createSulfuras();
     } else if (itemName.includes("conjured")) {
killedBy: Item name is Sulfuras It never has to be sold and it never loses it's quality
statusReason: expected +0 to equal 1

[Killed] ConditionalExpression
src/gilded_rose.mjs:56:16
       return this.createBackstagePasses();
     } else if (itemName.includes("sulfuras")) {
       return this.createSulfuras();
-    } else if (itemName.includes("conjured")) {
+    } else if (false) {
       return this.createConjured();
     } else {
killedBy: Gilded Rose conjured Items degrades twice as fast as normal items When sell in date is greater than zero, quality decrements by two
statusReason: expected 4 to equal 3

[Killed] ConditionalExpression
src/gilded_rose.mjs:56:16
       return this.createBackstagePasses();
     } else if (itemName.includes("sulfuras")) {
       return this.createSulfuras();
-    } else if (itemName.includes("conjured")) {
+    } else if (true) {
       return this.createConjured();
     } else {
killedBy: Gilded Rose normal items When sell in date is greater than zero, quality decrements by one
statusReason: expected 1 to equal 2

[Killed] BlockStatement
src/gilded_rose.mjs:58:12
       return this.createSulfuras();
     } else if (itemName.includes("conjured")) {
       return this.createConjured();
-    } else {
-      return this.createNormalItems();
-    }
+    } else {}
   }
 }
killedBy: Gilded Rose normal items When sell in date is greater than zero, quality decrements by one
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
src/gilded_rose.mjs:65:22
 }
 
 export class Shop {
-  constructor(items) {
-    this.items = items;
-  }
+  constructor(items) {}
 
   updateQuality() {
killedBy: Item name is Aged Brie When sell in date is greater than one, quality increments by one
statusReason: this.items is not iterable

[Killed] BlockStatement
src/gilded_rose.mjs:69:19
     this.items = items;
   }
 
-  updateQuality() {
-    let updatedItems = [];
-    for (const item of this.items) {
-      updatedItems = updatedItems.concat(item.update());
-    }
-
-    return updatedItems;
-  }
+  updateQuality() {}
 }
 
killedBy: Gilded Rose conjured Items degrades twice as fast as normal items When sell in date is greater than zero, quality decrements by two
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/gilded_rose.mjs:71:36
 
   updateQuality() {
     let updatedItems = [];
-    for (const item of this.items) {
-      updatedItems = updatedItems.concat(item.update());
-    }
+    for (const item of this.items) {}
 
     return updatedItems;
killedBy: Item name has Backstage passes When sell in date is greater than 10, quality increments by one
statusReason: Cannot read properties of undefined (reading 'name')
